---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.GetFormatOptions
source: html/c0f20eb6-3e5e-11b3-458c-f38acbe2cddd.htm
---
# Autodesk.Revit.DB.ScheduleField.GetFormatOptions Method

Gets the FormatOptions to optionally override the default settings in the Units class.

## Syntax (C#)
```csharp
public FormatOptions GetFormatOptions()
```

## Returns
A copy of the FormatOptions.